import os, sys


#  ******************************************************************************
                        # DIRECTORIES VARIABLES #


BASE_DIR = f"{os.path.abspath(os.path.dirname(__file__))}/"
RES_DIR = f"{BASE_DIR}res/"


# ******************************************************************************

                            # MPF VARIABLES #
PRECISION = 32
DEFAULT_PREC = 48

#  ******************************************************************************


#Имена, начинающиеся с _ это private переменные.